app/Controllers/Students.php

SELECT *
FROM `students`
---
    public function index()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/login');
        }

        // Load the model
        $studentModel = new \App\Models\StudentModel();

        // Get real student data from DB
        $data['students'] = $studentModel->findAll();

SELECT *
FROM `students`
WHERE `student_id` = 'K5150204'
 LIMIT 1
---
    public function store()
    {
        $request = service('request');

        $student_id = $request->getPost('student_id');

        // Ivavalidate kung nageexist na yung student ID
        $studentModel = new \App\Models\StudentModel();
        if ($studentModel->where('student_id', $student_id)->first()) {